'''
Напишіть функцію, яка приймає додатне ціле число та повертає наступне менше додатне ціле число, що містить ті самі цифри.

Наприклад:

next_smaller(21) == 12
next_smaller(531) == 513
next_smaller(2071) == 2017

Повертає -1 (для Haskell: повертає Nothing, для Rust: повертає None), коли немає меншого числа, яке містить ті самі цифри. Також повертає -1, коли наступне менше число з тими самими цифрами вимагатиме, щоб початкова цифра була нулем.

next_smaller(9) == -1
next_smaller(135) == -1
next_smaller(1027) == -1 # 0721 не працює, оскільки ми не записуємо числа з початковими нулями

деякі тести містять дуже великі числа.

тестові дані використовують лише додатні цілі числа.

Функція, яку ви пишете для цього завдання, є оберненою до цієї ката: «Наступне більше число з тими ж цифрами».
'''

def next_smaller(number):
    ...

# 121 -> 112
# "123" -> "123", "213", "231", "321"

# "1", "2", "3"

user_number = input("Введіть число: ")
print(list(user_number))
# print(user_number.split())

# print(list("123"))
