'''
Дезоксирибонуклеїнова кислота, ДНК, є основною молекулою-носієм інформації в біологічних системах. Вона складається з чотирьох нуклеїнових кислот: гуаніну ('G'), цитозину ('C'), аденіну ('A') та тиміну ('T').

Рибонуклеїнова кислота, РНК, є основною молекулою-мессенджером у клітинах. РНК дещо відрізняється від ДНК своєю хімічною структурою та не містить тиміну. ​​У РНК тимін замінюється іншою нуклеїновою кислотою урацилом ('U').

Створіть функцію, яка перетворює заданий рядок ДНК на РНК.

Наприклад:

"GCAT" => "GCAU"

Вхідний рядок може бути довільної довжини, зокрема, він може бути порожнім. Гарантовано, що всі вхідні дані будуть коректними, тобто кожен вхідний рядок складатиметься лише з 'G', 'C', 'A' та/або 'T'.
'''

def dna_to_rna(dna: str) -> str:
    return dna.replace('T', 'U')


print(dna_to_rna("GCAT"))
